/*
 * dss_cm2.h
 *
 *  Created on: Feb 4, 2013
 *      Author: XxXx
 */

#ifndef DSS_CM2_H_
#define DSS_CM2_H_


typedef volatile unsigned int _DSS_CM2_;

typedef struct
{
	_DSS_CM2_ CM_DSS_CLKSTCTRL;//0x00
	_DSS_CM2_ CM_DSS_STATICDEP;//0x04
	_DSS_CM2_ CM_DSS_DYNAMICDEP;//0x08
	_DSS_CM2_ RESERVED_0x0C;//0x0C
	_DSS_CM2_ RESERVED_0x10;//0x10
	_DSS_CM2_ RESERVED_0x14;//0x14
	_DSS_CM2_ RESERVED_0x18;//0x18
	_DSS_CM2_ RESERVED_0x1C;//0x1C
	_DSS_CM2_ CM_DSS_DSS_CLKCTRL;//0x20
	_DSS_CM2_ RESERVED_0x24;//0x24
	_DSS_CM2_ RESERVED;//0x28
}DSS_CM2_t;

#define DSS_CM2 (*(DSS_CM2_t *) 0x4A009100)

typedef enum
{
	DSS_CM2_MODULEMODE_gp = 0,
	DSS_CM2_MODULEMODE_gm = 3 << DSS_CM2_MODULEMODE_gp,
	DSS_CM2_MODULEMODE_DISABLED = 0,
	DSS_CM2_MODULEMODE_EXPLICIT_ENABLE = 2
}DSS_CM2_MODULEMODE_enum;

typedef enum
{
	DSS_CM2_OPTFCLKEN_DSSCLK_bp = 8,
	DSS_CM2_OPTFCLKEN_DSSCLK_bm = 1 << DSS_CM2_OPTFCLKEN_DSSCLK_bp,
}DSS_CM2_OPTFCLKEN_DSSCLK_enum;

typedef enum
{
	DSS_CM2_OPTFCLKEN_48MHZ_CLK_bp = 9,
	DSS_CM2_OPTFCLKEN_48MHZ_CLK_bm = 1 << DSS_CM2_OPTFCLKEN_48MHZ_CLK_bp,
}DSS_CM2_OPTFCLKEN_48MHZ_CLK_enum;

typedef enum
{
	DSS_CM2_OPTFCLKEN_SYS_CLK_bp = 10,
	DSS_CM2_OPTFCLKEN_SYS_CLK_bm = 1 << DSS_CM2_OPTFCLKEN_SYS_CLK_bp,
}DSS_CM2_OPTFCLKEN_SYS_CLK_enum;

typedef enum
{
	DSS_CM2_OPTFCLKEN_TV_FCLK_bp = 11,
	DSS_CM2_OPTFCLKEN_TV_FCLK_bm = 1 << DSS_CM2_OPTFCLKEN_TV_FCLK_bp,
}DSS_CM2_OPTFCLKEN_TV_FCLK_enum;

typedef enum
{
	DSS_CM2_IDLEST_gp = 16,
	DSS_CM2_IDLEST_gm = 3 << DSS_CM2_IDLEST_gp,
	DSS_CM2_IDLEST_FULL_FUNCTIONAL = 0,
	DSS_CM2_IDLEST_TRANSITION = 1,
	DSS_CM2_IDLEST_IDLE = 3,
	DSS_CM2_IDLEST_DISABLED = 3
}DSS_CM2_IDLEST_enum;

typedef enum
{
	DSS_CM2_STBYST_bp = 18,
	DSS_CM2_STBYST_bm = 1 << DSS_CM2_STBYST_bp,
}DSS_CM2_STBYST_enum;


#endif /* DSS_CM2_H_ */
