/*
 * dss_l3.h
 *
 *  Created on: Feb 4, 2013
 *      Author: XxXx
 */

#ifndef DSS_L3_L4PER_H_
#define DSS_L3_L4PER_H_

typedef volatile unsigned int _DSS_L3_L4PER_;

typedef struct
{
	_DSS_L3_L4PER_ DSS_REVISION;//0x00
	_DSS_L3_L4PER_ RESERVED_0x04;//0x0C
	_DSS_L3_L4PER_ RESERVED_0x08;//0x0C
	_DSS_L3_L4PER_ RESERVED_0x0C;//0x0C
	_DSS_L3_L4PER_ RESERVED_0x10;//0x10
	_DSS_L3_L4PER_ DSS_SYSSTATUS;//0x14
	_DSS_L3_L4PER_ RESERVED_0x18_0x3C[10];
	_DSS_L3_L4PER_ DSS_CTRL;//0x40
	_DSS_L3_L4PER_ RESERVED_0x44_58[5];
	_DSS_L3_L4PER_ DSS_STATUS;//0x5C
}DSS_L3_L4PER_t;

#define DSS_L3 (*(DSS_L3_t *) 0x58000000)
#define DSS_L4PER (*(DSS_L3_t *) 0x58000000)

typedef enum
{
	DSS_SYSSTATUS_RESETDONE_bp = 0,
	DSS_SYSSTATUS_RESETDONE_bm = 1 << DSS_SYSSTATUS_RESETDONE_bp
}DSS_SYSSTATUS_RESETDONE_enum;

typedef enum
{
	DSS_CTRL_LCD1_CLK_SWITCH_bp = 0,
	DSS_CTRL_LCD1_CLK_SWITCH_bm = 1 << DSS_CTRL_LCD1_CLK_SWITCH_bp,
	DSS_CTRL_LCD1_CLK_SWITCH_DSS_CLK = 0,
	DSS_CTRL_LCD1_CLK_SWITCH_PLL1_CLK1 = 1,

	DSS_CTRL_DSI1_CLK_SWITCH_bp = 1,
	DSS_CTRL_DSI1_CLK_SWITCH_bm = 1 << DSS_CTRL_DSI1_CLK_SWITCH_bp,
	DSS_CTRL_DSI1_CLK_SWITCH_DSS_CLK = 0,
	DSS_CTRL_DSI1_CLK_SWITCH_PLL1_CLK2 = 1,

	DSS_CTRL_VENC_CLOCK_MODE_bp = 2,
	DSS_CTRL_VENC_CLOCK_MODE_bm = 1 << DSS_CTRL_VENC_CLOCK_MODE_bp,
	DSS_CTRL_VENC_CLOCK_MODE_0 = 0,
	DSS_CTRL_VENC_CLOCK_MODE_1 = 1,

	DSS_CTRL_VENC_CLOCK_4X_ENABLE_bp = 3,
	DSS_CTRL_VENC_CLOCK_4X_ENABLE_bm = 1 << DSS_CTRL_VENC_CLOCK_4X_ENABLE_bp,
	DSS_CTRL_VENC_CLOCK_4X_ENABLE_DISABLE = 0,
	DSS_CTRL_VENC_CLOCK_4X_ENABLE_ENABLE = 1,

	DSS_CTRL_DAC_DEMEN_bp = 4,
	DSS_CTRL_DAC_DEMEN_bm = 1 << DSS_CTRL_DAC_DEMEN_bp,
	DSS_CTRL_DAC_DEMEN_DISABLE = 0,
	DSS_CTRL_DAC_DEMEN_ENABLE = 1,

	DSS_CTRL_DAC_POWERDN_BGZ_bp = 5,
	DSS_CTRL_DAC_POWERDN_BGZ_bm = 1 << DSS_CTRL_DAC_POWERDN_BGZ_bp,
	DSS_CTRL_DAC_POWERDN_BGZ_DISABLE = 0,
	DSS_CTRL_DAC_POWERDN_BGZ_ENABLE = 1,

	DSS_CTRL_VENC_OUT_SEL_bp = 6,
	DSS_CTRL_VENC_OUT_SEL_bm = 1 << DSS_CTRL_VENC_OUT_SEL_bp,
	DSS_CTRL_VENC_OUT_SEL_COMPOSITE = 0,
	DSS_CTRL_VENC_OUT_SEL_LUMINANCE = 1,

	DSS_CTRL_FCK_CLK_SWITCH_bp = 8,
	DSS_CTRL_FCK_CLK_SWITCH_bm = 1 << DSS_CTRL_FCK_CLK_SWITCH_bp,
	DSS_CTRL_FCK_CLK_SWITCH_DSS_CLK = 0,
	DSS_CTRL_FCK_CLK_SWITCH_PLL1_CLK1 = 1,
	DSS_CTRL_FCK_CLK_SWITCH_PLL2_CLK1 = 2,
	DSS_CTRL_FCK_CLK_SWITCH_PLL3_CLK1 = 3,

	DSS_CTRL_DSI2_CLK_SWITCH_bp = 10,
	DSS_CTRL_DSI2_CLK_SWITCH_bm = 1 << DSS_CTRL_DSI2_CLK_SWITCH_bp,
	DSS_CTRL_DSI2_CLK_SWITCH_DSS_CLK = 0,
	DSS_CTRL_DSI2_CLK_SWITCH_PLL2_CLK2 = 1,

	DSS_CTRL_TV_CLK_SWITCH_bp = 11,
	DSS_CTRL_TV_CLK_SWITCH_bm = 1 << DSS_CTRL_TV_CLK_SWITCH_bp,
	DSS_CTRL_TV_CLK_SWITCH_PLL3_CLK1 = 0,
	DSS_CTRL_TV_CLK_SWITCH_DSS_TV_CLK = 1,

	DSS_CTRL_LCD2_CLK_SWITCH_bp = 12,
	DSS_CTRL_LCD2_CLK_SWITCH_bm = 1 << DSS_CTRL_LCD2_CLK_SWITCH_bp,
	DSS_CTRL_LCD2_CLK_SWITCH_DSS_CLK = 0,
	DSS_CTRL_LCD2_CLK_SWITCH_PLL2_CLK1 = 1,

	DSS_CTRL_SYNC_SWITCH_bp = 13,
	DSS_CTRL_SYNC_SWITCH_bm = 1 << DSS_CTRL_SYNC_SWITCH_bp,
	DSS_CTRL_SYNC_SWITCH_INTERNAL_VENC_IP = 0,
	DSS_CTRL_SYNC_SWITCH_COMPONENT_VENC_IP = 1,

	DSS_CTRL_RFBI_SWITCH_bp = 14,
	DSS_CTRL_RFBI_SWITCH_bm = 1 << DSS_CTRL_RFBI_SWITCH_bp,
	DSS_CTRL_RFBI_SWITCH_LCD1 = 0,
	DSS_CTRL_RFBI_SWITCH_LCD2 = 1,

	DSS_CTRL_VENC_HDMI_SWITCH_bp = 15,
	DSS_CTRL_VENC_HDMI_SWITCH_bm = 1 << DSS_CTRL_VENC_HDMI_SWITCH_bp,
	DSS_CTRL_VENC_HDMI_SWITCH_VENC = 0,
	DSS_CTRL_VENC_HDMI_SWITCH_HDMI = 1,

	DSS_CTRL_LCD2_TV_SEL_bp = 17,
	DSS_CTRL_LCD2_TV_SEL_bm = 1 << DSS_CTRL_LCD2_TV_SEL_bp,
	DSS_CTRL_LCD2_TV_SEL_LCD2 = 0,
	DSS_CTRL_LCD2_TV_SEL_TV = 1
}DSS_CTRL_enum;

typedef enum
{
	DSS_STATUS_LCD1_CLK_STATUS_gp = 0,
	DSS_STATUS_LCD1_CLK_STATUS_gm = 0x03 << DSS_STATUS_LCD1_CLK_STATUS_gp,
	DSS_STATUS_LCD1_CLK_STATUS_LCD1_CLK = 0 << DSS_STATUS_LCD1_CLK_STATUS_gp,
	DSS_STATUS_LCD1_CLK_STATUS_DSS_CLK = 1 << DSS_STATUS_LCD1_CLK_STATUS_gp,
	DSS_STATUS_LCD1_CLK_STATUS_PLL1_CLK1 = 2 << DSS_STATUS_LCD1_CLK_STATUS_gp,

	DSS_STATUS_TV_CLK_OUT_STATUS_gp = 5,
	DSS_STATUS_TV_CLK_OUT_STATUS_gm = 0x03 << DSS_STATUS_TV_CLK_OUT_STATUS_gp,
	DSS_STATUS_TV_CLK_OUT_STATUS_TV_CLK = 1 << DSS_STATUS_TV_CLK_OUT_STATUS_gp,
	DSS_STATUS_TV_CLK_OUT_STATUS_HDMI_M_PCLK = 2 << DSS_STATUS_TV_CLK_OUT_STATUS_gp,

	DSS_STATUS_DSI1_CLK_STATUS_gp = 7,
	DSS_STATUS_DSI1_CLK_STATUS_gm = 0x03 << DSS_STATUS_DSI1_CLK_STATUS_gp,
	DSS_STATUS_DSI1_CLK_STATUS_DSI1_CLK = 0 << DSS_STATUS_DSI1_CLK_STATUS_gp,
	DSS_STATUS_DSI1_CLK_STATUS_DSS_CLK = 1 << DSS_STATUS_DSI1_CLK_STATUS_gp,
	DSS_STATUS_DSI1_CLK_STATUS_PLL1_CLK2 = 2 << DSS_STATUS_DSI1_CLK_STATUS_gp,

	DSS_STATUS_DSI2_CLK_STATUS_gp = 9,
	DSS_STATUS_DSI2_CLK_STATUS_gm = 0x03 << DSS_STATUS_DSI2_CLK_STATUS_gp,
	DSS_STATUS_DSI2_CLK_STATUS_DSI2_CLK = 0 << DSS_STATUS_DSI2_CLK_STATUS_gp,
	DSS_STATUS_DSI2_CLK_STATUS_DSS_CLK = 1 << DSS_STATUS_DSI2_CLK_STATUS_gp,
	DSS_STATUS_DSI2_CLK_STATUS_PLL2_CLK2 = 2 << DSS_STATUS_DSI2_CLK_STATUS_gp,

	DSS_STATUS_LCD2_CLK_STATUS_gp = 11,
	DSS_STATUS_LCD2_CLK_STATUS_gm = 0x03 << DSS_STATUS_LCD2_CLK_STATUS_gp,
	DSS_STATUS_LCD2_CLK_STATUS_LCD2_CLK = 0 << DSS_STATUS_LCD2_CLK_STATUS_gp,
	DSS_STATUS_LCD2_CLK_STATUS_DSS_CLK = 1 << DSS_STATUS_LCD2_CLK_STATUS_gp,
	DSS_STATUS_LCD2_CLK_STATUS_PPLL2_CLK1 = 2 << DSS_STATUS_LCD2_CLK_STATUS_gp,

	DSS_STATUS_TV_CLK_STATUS_gp = 13,
	DSS_STATUS_TV_CLK_STATUS_gm = 0x03 << DSS_STATUS_TV_CLK_STATUS_gp,
	DSS_STATUS_TV_CLK_STATUS_PLL3_CLK1 = 1 << DSS_STATUS_TV_CLK_STATUS_gp,
	DSS_STATUS_TV_CLK_STATUS_DSS_TV_CLK = 2 << DSS_STATUS_TV_CLK_STATUS_gp,

	DSS_STATUS_FCK_CLK_STATUS_gp = 15,
	DSS_STATUS_FCK_CLK_STATUS_gm = 0x0F << DSS_STATUS_FCK_CLK_STATUS_gp,
	DSS_STATUS_FCK_CLK_STATUS_DSS_CLK_SWITCHING_IS_ONGOING = 0 << DSS_STATUS_FCK_CLK_STATUS_gp,
	DSS_STATUS_FCK_CLK_STATUS_DSS_CLK_USED_BY_DISPC_AS_DISPC_FCLK = 1 << DSS_STATUS_FCK_CLK_STATUS_gp,
	DSS_STATUS_FCK_CLK_STATUS_PLL1_CLK1_USED_BY_DISPC_AS_DISPC_FCLK = 2 << DSS_STATUS_FCK_CLK_STATUS_gp,
	DSS_STATUS_FCK_CLK_STATUS_PLL2_CLK1_USED_BY_DISPC_AS_DISPC_FCLK = 4 << DSS_STATUS_FCK_CLK_STATUS_gp,
	DSS_STATUS_FCK_CLK_STATUS_PLL3_CLK1_USED_BY_DISPC_AS_DISPC_FCLK = 8 << DSS_STATUS_FCK_CLK_STATUS_gp,

	DSS_STATUS_SYNC_STATUS_gp = 19,
	DSS_STATUS_SYNC_STATUS_gm = 0x03 << DSS_STATUS_SYNC_STATUS_gp,
	DSS_STATUS_SYNC_STATUS_INTERNAL_VENC_IP_SELECTED = 0 << DSS_STATUS_SYNC_STATUS_gp,
	DSS_STATUS_SYNC_STATUS_COMPONENT_VENC_IP_SELECTED = 1 << DSS_STATUS_SYNC_STATUS_gp,
	DSS_STATUS_SYNC_STATUS_HDMI_IP_SELECTED = 2 << DSS_STATUS_SYNC_STATUS_gp,

	DSS_STATUS_RFBI_STATUS_gp = 21,
	DSS_STATUS_RFBI_STATUS_gm = 0x03 << DSS_STATUS_RFBI_STATUS_gp,
	DSS_STATUS_RFBI_STATUS_LCD1 = 0 << DSS_STATUS_RFBI_STATUS_gp,
	DSS_STATUS_RFBI_STATUS_LCD2 = 1 << DSS_STATUS_RFBI_STATUS_gp,
}DSS_L3_STATUS;

#endif /* DSS_L3_H_ */
