/*
 * wkup_cm.h
 *
 *  Created on: Jan 14, 2013
 *      Author: XxXx
 */

#ifndef WKUP_CM_H_
#define WKUP_CM_H_

typedef volatile unsigned int _WKUP_CM_;

typedef struct
{
	_WKUP_CM_ CM_WKUP_CLKSTCTRL;//0x00
	_WKUP_CM_ RESERVED_0x04;//0x04
	_WKUP_CM_ RESERVED_0x08;//0x08
	_WKUP_CM_ RESERVED_0x0C;//0x0C
	_WKUP_CM_ RESERVED_0x10;//0x10
	_WKUP_CM_ RESERVED_0x14;//0x14
	_WKUP_CM_ RESERVED_0x18;//0x18
	_WKUP_CM_ RESERVED_0x1C;//0x1C
	_WKUP_CM_ CM_WKUP_L4WKUP_CLKCTRL;//0x20
	_WKUP_CM_ RESERVED_0x24;//0x24
	_WKUP_CM_ RESERVED_0x28;//0x28
	_WKUP_CM_ RESERVED_0x2C;//0x2C
	_WKUP_CM_ CM_WKUP_WDTIMER2_CLKCTRL;//0x30
	_WKUP_CM_ RESERVED_0x34;//0x34
	_WKUP_CM_ CM_WKUP_GPIO1_CLKCTRL;//0x38
	_WKUP_CM_ RESERVED_0x3C;//0x3C
	_WKUP_CM_ CM_WKUP_GPTIMER1_CLKCTRL;//0x40
	_WKUP_CM_ RESERVED_0x44;//0x44
	_WKUP_CM_ RESERVED_0x48;//0x48
	_WKUP_CM_ RESERVED_0x4C;//0x4C
	_WKUP_CM_ CM_WKUP_32KTIMER_CLKCTRL;//0x50
	_WKUP_CM_ RESERVED_0x54;//0x54
	_WKUP_CM_ RESERVED_0x58;//0x58
	_WKUP_CM_ RESERVED_0x5C;//0x5C
	_WKUP_CM_ CM_WKUP_SARRAM_CLKCTRL;//0x60
	_WKUP_CM_ RESERVED_0x64;//0x64
	_WKUP_CM_ RESERVED_0x68;//0x68
	_WKUP_CM_ RESERVED_0x6C;//0x6C
	_WKUP_CM_ RESERVED_0x70;//0x70
	_WKUP_CM_ RESERVED_0x74;//0x74
	_WKUP_CM_ CM_WKUP_KEYBOARD_CLKCTRL;//0x78
	_WKUP_CM_ RESERVED_0x7C;//0x7C
	_WKUP_CM_ RESERVED_0x80;//0x80
	_WKUP_CM_ RESERVED_0x84;//0x84
	_WKUP_CM_ CM_WKUP_BANDGAP_CLKCTRL;//0x88
}WKUP_CM_t;

#define WKUP_CM (*(WKUP_CM_t *) 0x4A009400)

typedef enum
{
	WKUP_CM_MODULEMODE_gp = 0,
	WKUP_CM_MODULEMODE_gm = 3 << WKUP_CM_MODULEMODE_gp,
	WKUP_CM_MODULEMODE_DISABLED = 0,
	WKUP_CM_MODULEMODE_AUTOMATIC = 1,
	WKUP_CM_MODULEMODE_EXPLICIT_ENABLE = 2
}WKUP_CM_MODULEMODE_enum;

typedef enum
{
	WKUP_CM_OPTFCLKEN_DBCLK_bp = 8,
	WKUP_CM_OPTFCLKEN_DBCLK_bm = 1 << WKUP_CM_OPTFCLKEN_DBCLK_bp,
	WKUP_CM_OPTFCLKEN_DBCLK_CLOCK_DISABLED = 0,
	WKUP_CM_OPTFCLKEN_DBCLK_CLOCK_ENABLED = 1
}WKUP_CM_OPTFCLKEN_DBCLK_enum;

typedef enum
{
	WKUP_CM_IDLEST_gp = 16,
	WKUP_CM_IDLEST_gm = 3 << WKUP_CM_IDLEST_gp,
	WKUP_CM_IDLEST_FULL_FUNCTIONAL = 0,
	WKUP_CM_IDLEST_TRANSITION = 1,
	WKUP_CM_IDLEST_IDLE = 3,
	WKUP_CM_IDLEST_DISABLED = 3
}WKUP_CM_IDLEST_enum;

#endif /* WKUP_CM_H_ */
